In [1]:
import numpy as np 
import pandas as pd
import json

In [18]:
meta = pd.read_csv('C:/python/workspace/movie/the-movies-dataset/movies_metadata_e.csv')
display(meta.head())

,genres,id,original_language,original_title,title,Unnamed: 5,Unnamed: 6,Unnamed: 7
0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",862,en,Toy Story,Toy Story,NaN,NaN,NaN
1,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '...",8844,en,Jumanji,Jumanji,NaN,NaN,NaN
2,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ...",15602,en,Grumpier Old Men,Grumpier Old Men,NaN,NaN,NaN
3,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam...",31357,en,Waiting to Exhale,Waiting to Exhale,NaN,NaN,NaN
4,"[{'id': 35, 'name': 'Comedy'}]",11862,en,Father of the Bride Part II,Father of the Bride Part II,NaN,NaN,NaN

In [19]:
meta = meta[['id','original_title','original_language','genres']]
meta = meta.rename(columns={'id':'movieId'})
meta = meta[meta['original_language']=='en']
display(meta.head())

,movieId,original_title,original_language,genres
0,862,Toy Story,en,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '..."
1,8844,Jumanji,en,"[{'id': 12, 'name': 'Adventure'}, {'id': 14, '..."
2,15602,Grumpier Old Men,en,"[{'id': 10749, 'name': 'Romance'}, {'id': 35, ..."
3,31357,Waiting to Exhale,en,"[{'id': 35, 'name': 'Comedy'}, {'id': 18, 'nam..."
4,11862,Father of the Bride Part II,en,"[{'id': 35, 'name': 'Comedy'}]"

In [20]:
ratings = pd.read_csv('C:/python/workspace/movie/the-movies-dataset/ratings_small.csv')
ratings = ratings[['userId', 'movieId', 'rating']]
display(ratings.head())

   userId  movieId  rating
0       1       31     2.5
1       1     1029     3.0
2       1     1061     3.0
3       1     1129     2.0
4       1     1172     4.0

In [21]:
display(ratings.describe()) #count : 자료의 수 / mean : 평균값 / std : 표준편차

              userId        movieId         rating
count  100004.000000  100004.000000  100004.000000
mean      347.011310   12548.664363       3.543608
std       195.163838   26369.198969       1.058064
min         1.000000       1.000000       0.500000
25%       182.000000    1028.000000       3.000000
50%       367.000000    2406.500000       4.000000
75%       520.000000    5418.000000       4.000000
max       671.000000  163949.000000       5.000000

In [22]:
meta.movieId = pd.to_numeric(meta.movieId, errors='coerce')
ratings.movieId = pd.to_numeric(ratings.movieId, errors='coerce')